[
  {
    "title": "ActiveX Data Objects (ADO)",
    "content": "Очередное развитие сервисов унифицированного доступа к базам данных от Microsoft на базе технологии ActiveX, которая, в свою очередь, расширяет возможности COM компонентов."
  },
  {
    "title": "Application programming interface (API)",
    "content": "Интерфейс программирования приложения – функциональность приложения, доступная на программном уровне внешним программным компонентам. API, чаще всего, представляет собой набор программных компонентов, интерфейсов, глобальных функций и т.п. API приложения используется для интеграции с другими приложениями или для расширения и настройки собственной функциональности."
  },
  {
    "title": "Assembler",
    "content": "Транслятор программы из текста на языке ассемблера, в программу на машинном языке."
  },
  {
    "title": "Base Class Library (BCL)",
    "content": "Общая для всех языков программирования платформы Microsoft .NET Framework библиотека классов, в состав которой входят компоненты работы с различными структурами данных, файловыми структурами, базами данных, ресурсами в интернете и т.д."
  },
  {
    "title": "Common Intermediate Language (CIL)",
    "content": "Промежуточный язык программирования низкого уровня, обрабатываемый CLR. По мере обработки CIL кода, виртуальная машина CLR переводит его в машинный - платформо-зависимый код. CIL код является результатом предварительной компиляции программ, написанных на языках программирования высокого уровня."
  },
  {
    "title": "Common Language Runtime (CLR)",
    "content": "Исполняющая среда программной платформы Microsoft .NET Framework, интерпретирующая и контролирующая выполнение программного кода, представленного промежуточным CIL кодом."
  },
  {
    "title": "Common Language Specification (CLS)",
    "content": "Спецификация, которая включает в себя набор требований к CLS совместимому языку программирования, выполнение которых гарантирует возможность использования разработанных на нем программных компонентов, написанных на других CSL совместимых языках."
  },
  {
    "title": "Component Object Model (COM)",
    "content": "Технология разработки программных компонентов, предназначенных для повторного использования в различных приложениях. Унификация доступа к программным сервисам реализована на основе интерфейсов. Технологией COM компания Microsoft реализует идеи объектно-ориентированного проектирования программных компонентов, возможность использования которых не зависит от выбранного языка программирования и программной платформы."
  },
  {
    "title": "Code review",
    "content": "это процесс проверки и анализа кода задачи разработчиком перед ее релизом. Результатом CR является обратная связь по выполненной задаче: необходимость внести правки, либо готовность задачи к последующему тестированию и релизу."
  },
  {
    "title": "C#, C Sharp",
    "content": "Объектно-ориентированный язык программирования платформы Microsoft .NET Framework. По синтаксису очень схож с языками программирования C++ и Java."
  },
  {
    "title": "C++",
    "content": "объектно-ориентированный язык программирования, разработанный Бьерном Страуструпом."
  },
  {
    "title": "Delphi",
    "content": "Объектно-ориентированный язык программирования, созданный на основе языка программирования Pascal и среда разработки программных продуктов компании Borland."
  },
  {
    "title": "Document Object Model (DOM)",
    "content": "Программный интерфейс доступа к иерархическим структурам в оперативной памяти, соответствующим элементам документов, созданных на базе языков разметки, например, HTML, XML, XHTML и т.п. Обработка документов на основе DOM характеризуется полной загрузкой всего содержимого документа в оперативную память. Зачастую обеспечивает не только доступ, но и возможности программного редактирования документа."
  },
  {
    "title": "Document Type Definition (DTD)",
    "content": "Специальный язык, который, также как и XML Schema предназначен для описания синтаксических правил XML расширения. Язык DTD, в отличие от XML Schema, сам не является XML расширением, и в настоящее время считается устаревшим стандартом."
  },
  {
    "title": "Framework",
    "content": "Программная платформа, определяющая структуру программной системы; программное обеспечение, облегчающее разработку и объединение разных компонентов большого программного проекта."
  },
  {
    "title": "Graphical User Interface (GUI)",
    "content": "Графический пользовательский интерфейс, предоставляемый современными операционными системами, такими как Windows (Microsoft), Mac OS (Apple) и т.п. GUI представлен графическими окнами, кнопками, списками и прочими элементами управления, манипуляция которыми осуществляется посредством мыши и (или) клавиатуры."
  },
  {
    "title": "HyperText Markup Language (HTML)",
    "content": "Язык разметки веб-страниц, предназначенный для форматирования их содержимого (контента), отображаемого браузерами."
  },
  {
    "title": "HTTP (HyperText Transfer Protocol)",
    "content": "Сетевой прокол прикладного уровня на базе TCP/IP, предназначенный для передачи гипертекста в условиях клиент-серверного окружения. В основном используется для обмена данными между пользователями и ресурсами в сети интернет – является средством общения распределенных компонентов всемирной паутины."
  },
  {
    "title": "Java",
    "content": "Объектно-ориентированный язык программирования, разработанных компанией Sun Microsystems."
  },
  {
    "title": "JavaScript",
    "content": "Встроенный в интернет-браузер процедурный язык программирования. Назначение JavaScript – манипуляция элементами HTML разметки посредством программных интерфейсов объектной модели загруженной интернет страницы (DOM)."
  },
  {
    "title": "jQuery",
    "content": "Библиотека, написанная на JavaScript и созданная с целью упрощения взаимодействия с элементами HTML разметки при создании динамических интернет страниц. jQuery предоставляет программный интерфейс запросов к данным объектной модели загруженной страницы с возможностью выполнения ряда операций над результатами этих запросов."
  },
  {
    "title": "Just-in-time compiler (JIT compiler)",
    "content": "Компилятор промежуточного кода, такого как байт-код (промежуточный язык программирования, обрабатываемый виртуальной машиной Java - JVM) или CIL код в машинный код. JIT компиляция происходит во время исполнения программы виртуальной машиной и затрагивает не весь код, а только тот, который необходимо исполнить в настоящий момент. Использование промежуточного кода и исполняемой его виртуальной машины дает независимость от программной платформы (операционной системы), а частичная JIT компиляция – экономию по времени в сравнении с компиляцией всего кода или в сравнении с процессом трансляции (построчной компиляции)."
  },
  {
    "title": "Language Integrated Query (LINQ)",
    "content": "Расширение объектно-ориентированных языков программирования платформы Microsoft .NET Framework синтаксисом структурированных запросов, разработанное той же компанией. Используя LINQ, можно производить выборку набора объектов из некоторого множества (коллекции объектов) практически так же, как осуществляется отбор записей из таблиц реляционной базы данных посредством SQL, синтаксис которого во многом позаимствован авторами LINQ."
  },
  {
    "title": "Managed code",
    "content": "Термин, введённый фирмой Microsoft, для обозначения кода программы, исполняемой под «управлением» виртуальной машины .NET — Common Language Runtime или Mono."
  },
  {
    "title": "Microsoft Developer Network (MSDN)",
    "content": "Подразделение компании Microsoft и созданный этим подразделением информационный сервис, предназначенный для информационной поддержки разработчиков программного и аппаратного обеспечения, использующих или ориентирующихся на технологии Microsoft."
  },
  {
    "title": "Microsoft Visual Studio",
    "content": "Интегрированная среда разработки программных продуктов компании Microsoft, которая, в том числе, поддерживает языки программирования для платформы Microsoft .NET Framework."
  },
  {
    "title": "Microsoft .NET Framework",
    "content": "Одна из последних программных технологий компании Microsoft, созданная для разработки платформонезависимых приложений, исполняемых виртуальной машиной CLR."
  },
  {
    "title": "Open Database Connectivity (ODBC)",
    "content": "API для унифицированного доступа к базам данных - предшественник OleDB."
  },
  {
    "title": "Object Linking and Embedding, Database (OLE DB)",
    "content": "Библиотека COM интерфейсов унифицированного доступа к базам данных. OLE DB разработана Microsoft на смену ODBC."
  },
  {
    "title": "Pascal",
    "content": "Один из наиболее известных языков программирования высокого уровня, который широко используется в целях обучения программированию. Объектный Паскаль (Object Pascal) является объектно-ориентированным расширением Паскаля, на основе которого создан язык программирования Delphi."
  },
  {
    "title": "Plug-In",
    "content": "Внешний по отношению к основному программному продукту компонент, который в ходе работы основного приложения может быть динамически к нему подключен и запущен. Как правило, такие модули используют базовую функциональность программы - контейнера для ее расширения и настройки - кастомизации. Plug-In компоненты разрабатываются по определенным контейнером программным спецификациям, а доступ к его базовой функциональности получают в процессе подключения через внутренний API."
  },
  {
    "title": "Procedural Language (PL)",
    "content": "Процедурное расширение языка SQL, разработанной компанией Oracle для своих СУБД."
  },
  {
    "title": "Refactoring",
    "content": "Перепроектирование кода, переработка кода, равносильное преобразование алгоритмов — процесс изменения внутренней структуры программы, не затрагивающий её внешнего поведения и имеющий целью облегчить понимание её работы."
  },
  {
    "title": "Service-Oriented Architecture (SOA)",
    "content": "Модульный подход к разработке программного обеспечения, базирующийся на обеспечении удаленного по стандартизированным протоколам использования распределённых, слабо связанных легко заменяемых компонентов (сервисов) со стандартизированными интерфейсами."
  },
  {
    "title": "Simple API for XML (SAX)",
    "content": "Программный интерфейс последовательного доступа к содержимому XML документа в процессе чтения XML файла или последовательного формирования XML документа в процессе записи XML файла. Преимущества, в сравнении с DOM – это экономия оперативной памяти в процессе обработки."
  },
  {
    "title": "Structured Query Language (SQL)",
    "content": "Язык описания структурированных запросов к базам данных, результатом выполнения которых может быть или структурированный набор информации (результат выборки или кортеж) или изменения в составе данных (модификация данных). Также, инструкции SQL позволяют изменять саму структуру базы данных (определение данных), настраивать параметры доступа к различным ее разделам (определение доступа) и управлять транзакциями: применять или откатывать текущие изменения."
  },
  {
    "title": "Transact-SQL (T-SQL)",
    "content": "Процедурное расширение языка SQL, разработанной компанией Microsoft для своей СУБД SQL Server."
  },
  {
    "title": "Unified Modeling Language (UML)",
    "content": "Унифицированный язык моделирования предметной области, представленный набором нотаций к графическому представлению диаграмм классов, компонентов, прецедентов использования подсистем, бизнес-процессов и т.д."
  },
  {
    "title": "World Wide Web Consortium (W3C)",
    "content": "Международная организация, основной деятельностью которой является разработка технологических стандартов для всемирной паутины и рекомендаций по их внедрению для разработчиков программного обеспечения."
  },
  {
    "title": "eXtensible HyperText Markup Language (XHTML)",
    "content": "Расширение XML, реализующее и расширяющее возможности HTML."
  },
  {
    "title": "eXtensible Markup Language (XML)",
    "content": "Обобщенный язык разметки, предназначенный для создания на основе себя расширений: специализированных языков разметки или текстовых форматов для хранения и обмена наборами различного рода структурированной информации."
  },
  {
    "title": "XML Path Language (XPath)",
    "content": "Язык структурированных запросов к элементам XML. Выполняет те же функции по отношению к XML документу, что и SQL по отношению к базе данных."
  },
  {
    "title": "XML Schema",
    "content": "Расширение XML, предназначенное для описания правил и проверки на соответствие этим правилам специализированных XML документов."
  }
]
